#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.8`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.local_file.file_system_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_system_prompt: Read complete after 0s [id=1b64caca607e392bc85ff27243e6022401cc3184][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/bfr-dev-uai001][0m
[0m[1mmodule.app_service_plan.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.Web/serverFarms/bfr-dev-asp001][0m
[0m[1mmodule.azure_open_ai.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/bfr-dev-aoai001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-kv001][0m
[0m[1mmodule.cosmosdb_account.azurerm_cosmosdb_account.cosmosdb_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.DocumentDB/databaseAccounts/bfr-dev-cosmos001][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.Insights/components/bfr-dev-appi001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mazapi_resource.subnet_web_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/WebAppSubnetBot][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mazurerm_role_assignment.uai_roleassignment_open_ai_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/bfr-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/ad2b248a-d706-21bc-b29f-9f9282eabdd8][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.Web/serverFarms/bfr-dev-asp001][0m
[0m[1mmodule.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.Web/serverFarms/bfr-dev-asp001|applicationLogs-0][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/bfr-dev-aoai001][0m
[0m[1mmodule.azure_open_ai.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/bfr-dev-aoai001|applicationLogs-0][0m
[0m[1mmodule.cosmosdb_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cosmosdb_account: Reading...[0m[0m
[0m[1mazurerm_cosmosdb_sql_database.cosmosdb_sql_database: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.DocumentDB/databaseAccounts/bfr-dev-cosmos001/sqlDatabases/BotDb][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_role_assignment.uai_roleassignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-kv001/providers/Microsoft.Authorization/roleAssignments/ab845489-85c6-c790-8cd8-de4252566894][0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-kv001/providers/Microsoft.Authorization/roleAssignments/ec2cb383-d23c-8378-580d-1785b35a1b59][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mmodule.bot_service.data.azurerm_application_insights.application_insights: Reading...[0m[0m
[0m[1mmodule.cosmosdb_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cosmosdb_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.DocumentDB/databaseAccounts/bfr-dev-cosmos001][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.Insights/components/bfr-dev-appi001][0m
[0m[1mmodule.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.Insights/components/bfr-dev-appi001|applicationLogs-0][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnetBot][0m
[0m[1mmodule.cosmosdb_account.azurerm_private_endpoint.private_endpoint_cosmosdb_account["Sql"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.Network/privateEndpoints/bfr-dev-cosmos001-Sql-pe][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.Network/privateEndpoints/bfr-dev-kv001-vault-pe][0m
[0m[1mmodule.azure_open_ai.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.Network/privateEndpoints/bfr-dev-aoai001-account-pe][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.KeyVault/vaults/bfr-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.bot_service.data.azurerm_application_insights.application_insights: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.Insights/components/bfr-dev-appi001][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-31T10:28:21Z][0m
[0m[1mmodule.azure_open_ai.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-31T10:26:21Z][0m
[0m[1mmodule.cosmosdb_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-31T10:35:04Z][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_linux_web_app[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_linux_web_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # azurerm_bot_connection.bot_connection_aadv2_oauth[0m will be created
[0m  [32m+[0m[0m resource "azurerm_bot_connection" "bot_connection_aadv2_oauth" {
      [32m+[0m[0m bot_name              = "bfr-dev-bot001"
      [32m+[0m[0m client_id             = (sensitive value)
      [32m+[0m[0m client_secret         = (sensitive value)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m location              = "global"
      [32m+[0m[0m name                  = "aadv2-oauth"
      [32m+[0m[0m parameters            = {
          [32m+[0m[0m "tenantId" = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
        }
      [32m+[0m[0m resource_group_name   = "bfr-dev-bot-rg"
      [32m+[0m[0m scopes                = "openid profile User.Read User.ReadBasic.All"
      [32m+[0m[0m service_provider_name = "Aadv2"
    }

[1m  # azurerm_cognitive_deployment.cognitive_deployment_gpt_4o[0m will be created
[0m  [32m+[0m[0m resource "azurerm_cognitive_deployment" "cognitive_deployment_gpt_4o" {
      [32m+[0m[0m cognitive_account_id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/bfr-dev-aoai001"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m name                   = "gpt-4o"
      [32m+[0m[0m version_upgrade_option = "OnceNewDefaultVersionAvailable"

      [32m+[0m[0m model {
          [32m+[0m[0m format  = "OpenAI"
          [32m+[0m[0m name    = "gpt-4o"
          [32m+[0m[0m version = "2024-08-06"
        }

      [32m+[0m[0m sku {
          [32m+[0m[0m capacity = 75
          [32m+[0m[0m name     = "Standard"
        }
    }

[1m  # azurerm_linux_web_app.linux_web_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_linux_web_app" "linux_web_app" {
      [32m+[0m[0m app_settings                                   = {
          [32m+[0m[0m "APPLICATIONINSIGHTS_CONNECTION_STRING"      = (sensitive value)
          [32m+[0m[0m "AZURE_COSMOS_CONTAINER_ID"                  = "bot-data"
          [32m+[0m[0m "AZURE_COSMOS_DATABASE_ID"                   = "BotDb"
          [32m+[0m[0m "AZURE_COSMOS_ENDPOINT"                      = "https://bfr-dev-cosmos001.documents.azure.com:443/"
          [32m+[0m[0m "AZURE_COSMOS_KEY"                           = (sensitive value)
          [32m+[0m[0m "AZURE_OPENAI_ASSISTANT_ID"                  = [90mnull[0m[0m
          [32m+[0m[0m "AZURE_OPENAI_MODEL_NAME"                    = "gpt-4o"
          [32m+[0m[0m "AZURE_OPENAI_SYSTEM_PROMPT"                 = <<-EOT
                You are a world-class assistant who tells jokes. For anything but jokes, respond politely that you are just trying to make everyone’s life a happier place.
            EOT
          [32m+[0m[0m "AZURE_OPEN_AI_API_VERSION"                  = "2024-05-01-preview"
          [32m+[0m[0m "AZURE_OPEN_AI_ENDPOINT"                     = "https://bfr-dev-aoai001.openai.azure.com/"
          [32m+[0m[0m "ApplicationInsightsAgent_EXTENSION_VERSION" = "~3"
          [32m+[0m[0m "MANAGED_IDENTITY_CLIENT_ID"                 = "f62cddf3-4da0-4325-a689-e46bfc41a9ab"
          [32m+[0m[0m "MICROSOFT_APP_ID"                           = "f62cddf3-4da0-4325-a689-e46bfc41a9ab"
          [32m+[0m[0m "MICROSOFT_APP_PASSWORD"                     = [90mnull[0m[0m
          [32m+[0m[0m "MICROSOFT_APP_TENANTID"                     = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
          [32m+[0m[0m "MICROSOFT_APP_TYPE"                         = "UserAssignedMSI"
          [32m+[0m[0m "OAUTH_CONNECTION_NAME"                      = "aadv2-oauth"
          [32m+[0m[0m "SCM_DO_BUILD_DURING_DEPLOYMENT"             = "1"
          [32m+[0m[0m "WEBSITE_CONTENTOVERVNET"                    = "1"
        }
      [32m+[0m[0m client_affinity_enabled                        = false
      [32m+[0m[0m client_certificate_enabled                     = false
      [32m+[0m[0m client_certificate_mode                        = "Required"
      [32m+[0m[0m custom_domain_verification_id                  = (sensitive value)
      [32m+[0m[0m default_hostname                               = (known after apply)
      [32m+[0m[0m enabled                                        = true
      [32m+[0m[0m ftp_publish_basic_authentication_enabled       = false
      [32m+[0m[0m hosting_environment_id                         = (known after apply)
      [32m+[0m[0m https_only                                     = true
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m key_vault_reference_identity_id                = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/bfr-dev-uai001"
      [32m+[0m[0m kind                                           = (known after apply)
      [32m+[0m[0m location                                       = "northeurope"
      [32m+[0m[0m name                                           = "bfr-dev-app001"
      [32m+[0m[0m outbound_ip_address_list                       = (known after apply)
      [32m+[0m[0m outbound_ip_addresses                          = (known after apply)
      [32m+[0m[0m possible_outbound_ip_address_list              = (known after apply)
      [32m+[0m[0m possible_outbound_ip_addresses                 = (known after apply)
      [32m+[0m[0m public_network_access_enabled                  = true
      [32m+[0m[0m resource_group_name                            = "bfr-dev-bot-rg"
      [32m+[0m[0m service_plan_id                                = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.Web/serverFarms/bfr-dev-asp001"
      [32m+[0m[0m site_credential                                = (sensitive value)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
      [32m+[0m[0m virtual_network_subnet_id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/WebAppSubnetBot"
      [32m+[0m[0m webdeploy_publish_basic_authentication_enabled = false
      [32m+[0m[0m zip_deploy_file                                = (known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m

      [32m+[0m[0m identity {
          [32m+[0m[0m identity_ids = [
              [32m+[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/bfr-dev-uai001",
            ]
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "UserAssigned"
        }

      [32m+[0m[0m site_config {
          [32m+[0m[0m always_on                               = true
          [32m+[0m[0m app_command_line                        = "gunicorn --bind 0.0.0.0 --worker-class aiohttp.worker.GunicornWebWorker --timeout 600 app:APP"
          [32m+[0m[0m container_registry_use_managed_identity = false
          [32m+[0m[0m default_documents                       = (known after apply)
          [32m+[0m[0m detailed_error_logging_enabled          = (known after apply)
          [32m+[0m[0m ftps_state                              = "Disabled"
          [32m+[0m[0m http2_enabled                           = true
          [32m+[0m[0m ip_restriction_default_action           = "Allow"
          [32m+[0m[0m linux_fx_version                        = (known after apply)
          [32m+[0m[0m load_balancing_mode                     = "LeastRequests"
          [32m+[0m[0m local_mysql_enabled                     = false
          [32m+[0m[0m managed_pipeline_mode                   = "Integrated"
          [32m+[0m[0m minimum_tls_version                     = "1.2"
          [32m+[0m[0m remote_debugging_enabled                = false
          [32m+[0m[0m remote_debugging_version                = "VS2022"
          [32m+[0m[0m scm_ip_restriction_default_action       = "Allow"
          [32m+[0m[0m scm_minimum_tls_version                 = "1.2"
          [32m+[0m[0m scm_type                                = (known after apply)
          [32m+[0m[0m scm_use_main_ip_restriction             = false
          [32m+[0m[0m use_32_bit_worker                       = false
          [32m+[0m[0m vnet_route_all_enabled                  = true
          [32m+[0m[0m websockets_enabled                      = false
          [32m+[0m[0m worker_count                            = 1

          [32m+[0m[0m application_stack {
              [32m+[0m[0m python_version = "3.11"
            }

          [32m+[0m[0m cors {
              [32m+[0m[0m allowed_origins     = [
                  [32m+[0m[0m "https://botservice.hosting.portal.azure.net",
                  [32m+[0m[0m "https://hosting.onecloud.azure-test.net",
                ]
              [32m+[0m[0m support_credentials = true
            }
        }
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_linux_web_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_linux_web_app" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # azurerm_private_endpoint.linux_web_app_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "linux_web_app_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "bfr-dev-app001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "bfr-dev-app001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "bfr-dev-bot-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnetBot"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "bfr-dev-app001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "bfr-dev-app001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "sites",
            ]
        }
    }

[1m  # module.bot_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_bot_service_azure_bot[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_bot_service_azure_bot" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.bot_service.azurerm_bot_service_azure_bot.bot_service_azure_bot[0m will be created
[0m  [32m+[0m[0m resource "azurerm_bot_service_azure_bot" "bot_service_azure_bot" {
      [32m+[0m[0m developer_app_insights_application_id = "56e034c7-9be7-4d37-b195-acc4fce692a2"
      [32m+[0m[0m developer_app_insights_key            = "b24a73a2-8bf5-4ef7-9585-065ba6b75e53"
      [32m+[0m[0m display_name                          = "Azure Bot Service - Bfr Dev Bot001"
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m icon_url                              = "https://docs.botframework.com/static/devportal/client/images/bot-framework-default.png"
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m local_authentication_enabled          = false
      [32m+[0m[0m location                              = "global"
      [32m+[0m[0m luis_app_ids                          = []
      [32m+[0m[0m microsoft_app_id                      = "f62cddf3-4da0-4325-a689-e46bfc41a9ab"
      [32m+[0m[0m microsoft_app_msi_id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/bfr-dev-bot-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/bfr-dev-uai001"
      [32m+[0m[0m microsoft_app_tenant_id               = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
      [32m+[0m[0m microsoft_app_type                    = "UserAssignedMSI"
      [32m+[0m[0m name                                  = "bfr-dev-bot001"
      [32m+[0m[0m public_network_access_enabled         = true
      [32m+[0m[0m resource_group_name                   = "bfr-dev-bot-rg"
      [32m+[0m[0m sku                                   = "S1"
      [32m+[0m[0m streaming_endpoint_enabled            = false
      [32m+[0m[0m tags                                  = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
    }

[1m  # module.bot_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_bot_service_azure_bot["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_bot_service_azure_bot" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.bot_service.azurerm_private_endpoint.bot_service_azure_bot_private_endpoint_bot[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "bot_service_azure_bot_private_endpoint_bot" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "bfr-dev-bot001-bot-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "bfr-dev-bot001-bot-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "bfr-dev-bot-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnetBot"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "bfr-dev-bot001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.directline.botframework.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "bfr-dev-bot001-bot-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "Bot",
            ]
        }
    }

[1m  # module.bot_service.azurerm_private_endpoint.bot_service_azure_bot_private_endpoint_token[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "bot_service_azure_bot_private_endpoint_token" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "bfr-dev-bot001-token-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "bfr-dev-bot001-token-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "bfr-dev-bot-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnetBot"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "bfr-dev-bot001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.token.botframework.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "bfr-dev-bot001-token-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "Token",
            ]
        }
    }

[1m  # module.bot_service.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "120s"
      [32m+[0m[0m id              = (known after apply)
    }

[1mPlan:[0m 10 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>